MorgothCreator/mSdk/SDK/platform/stm32f4xx/interface/i2s_interface.c
/** @addtogroup STM32469I-Discovery
  * @{
  */

/** @defgroup STM32469I-Discovery_AUDIO STM32469I-Discovery AUDIO
  * @brief This file includes the low layer driver for CS43L22 Audio Codec
  *        available on STM32469I-Discovery board(MB1189).
  * @{
  */

/** @defgroup STM32469I-Discovery_AUDIO_Private_Types STM32469I Discovery Audio Private Types
  * @{
  */
/**
  * @}
  */

/** @defgroup STM32469I-Discovery_AUDIO_Private_Defines STM32469I Discovery Audio Private Defines
 *  @brief Headphone1 (CN27 of STM32469I-Discovery board) is connected to the
 *         HEADPHONE output of CS43L22 Audio Codec.
 *         Headphone2 (CN26 of STM32469I-Discovery board) is connected to the
 *         SPEAKER output of CS43L22 Audio Codec.
  * @{
  */
#define OUTPUT_DEVICE_HEADPHONE1 OUTPUT_DEVICE_HEADPHONE

/* Headphone2 is connected to Speaker output of the CS43L22 codec */
#define OUTPUT_DEVICE_HEADPHONE2 OUTPUT_DEVICE_SPEAKER
/**
  * @}
  */

/** @defgroup STM32469I-Discovery_AUDIO_Private_Macros STM32469I Discovery Audio Private macros
  * @{
  */

/*### PLAY ###*/
/* SCK(kHz) = SAI_CK_x/(SAIClockDivider*2*256) */
#define SAIClockDivider(__FREQUENCY__) \
        (__FREQUENCY__ == AUDIO_FREQUENCY_8K)  ? 12 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_11K) ? 2 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_16K) ? 6 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_22K) ? 1 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_32K) ? 3 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_44K) ? 0 \
      : (__FREQUENCY__ == AUDIO_FREQUENCY_48K) ? 2 : 1  \

/**
  * @}
  */

/** @defgroup STM32469I-Discovery_AUDIO_Private_Variables STM32469I Discovery Audio Private Variables
  * @{
  */

/*
Note:
  these global variables are not compliant to naming rules (upper case without "_" ),
  but we keep this naming for compatibility, in fact these variables (not static)
  could have been used by the application, example the stm32f4xx_it.c:
    void DMA2_Stream6_IRQHandler(void)
     {  HAL_DMA_IRQHandler(haudio_out_sai.hdmatx);  }
*/
void          *audio_drv;
SAI_HandleTypeDef         haudio_out_sai;
I2S_HandleTypeDef         haudio_in_i2s;
TIM_HandleTypeDef         haudio_tim;

PDMFilter_InitStruct Filter[2];
unsigned char Channel_Demux[128] = {
    0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
    0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
    0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
    0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
    0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
    0x00, 0x01, 0x00, 0x01, 0x02, 0x03, 0x02, 0x03,
    0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
    0x04, 0x05, 0x04, 0x05, 0x06, 0x07, 0x06, 0x07,
    0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
    0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
    0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
    0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
    0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
    0x08, 0x09, 0x08, 0x09, 0x0a, 0x0b, 0x0a, 0x0b,
    0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f,
    0x0c, 0x0d, 0x0c, 0x0d, 0x0e, 0x0f, 0x0e, 0x0f
};

unsigned short volatile AudioInVolume = DEFAULT_AUDIO_IN_VOLUME;

I2S_Out i2s_interface_out = {
		BSP_AUDIO_OUT_Init,
		BSP_AUDIO_OUT_Play,
		BSP_AUDIO_OUT_ChangeBuffer,
		BSP_AUDIO_OUT_Pause,
		BSP_AUDIO_OUT_Resume,
		BSP_AUDIO_OUT_Stop,
		BSP_AUDIO_OUT_SetVolume,
		BSP_AUDIO_OUT_SetFrequency,
		BSP_AUDIO_OUT_SetAudioFrameSlot,
		BSP_AUDIO_OUT_SetMute,
		BSP_AUDIO_OUT_SetOutputMode,
		BSP_AUDIO_OUT_DeInit
};

I2S_In i2s_interface_in = {
		BSP_AUDIO_IN_Init,
		BSP_AUDIO_IN_Record,
		BSP_AUDIO_IN_Stop,
		BSP_AUDIO_IN_Pause,
		BSP_AUDIO_IN_Resume,
		BSP_AUDIO_IN_SetVolume,
		BSP_AUDIO_IN_DeInit,
		BSP_AUDIO_IN_PDMToPCM
};

/**
  * @}
  */

/** @defgroup STM32469I-Discovery_AUDIO_Private_Function_Prototypes STM32469I Discovery Audio Private Prototypes
  * @{
  */
static void AUDIO_CODEC_Reset(void *param);
static unsigned char SAIx_Init(void *param, unsigned long AudioFreq);
static void SAIx_DeInit(void *param);
static void I2Sx_Init(unsigned long AudioFreq);
static void I2Sx_DeInit(void *param);
static void TIMx_IC_MspInit(TIM_HandleTypeDef *htim);
static void TIMx_IC_MspDeInit(TIM_HandleTypeDef *htim);
static void TIMx_Init(void);
static void TIMx_DeInit(void);
static void PDMDecoder_Init(unsigned long AudioFreq, unsigned long ChnlNbr);

void BSP_AUDIO_OUT_ChangeAudioConfig(void *param, unsigned long AudioOutOption);

/**
  * @}
  */

/** @defgroup STM32469I-Discovery_AUDIO_out_Private_Functions STM32469I Discovery AudioOut Private Functions
  * @{
  */

/**
  * @brief  Configures the audio peripherals.
  * @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       or OUTPUT_DEVICE_BOTH.
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @note   The SAI PLL input clock must be done in the user application.
  * @retval AUDIO_OK if correct communication, else wrong communication
  */
unsigned char BSP_AUDIO_OUT_Init(void *param, unsigned short OutputDevice,
                           unsigned char Volume,
                           unsigned long AudioFreq)
{
	I2S_t *_param = (I2S_t *)param;
  unsigned char ret = AUDIO_OK;

  SAIx_DeInit(param);

  /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
  BSP_AUDIO_OUT_ClockConfig(&haudio_out_sai, AudioFreq, NULL);

  /* SAI data transfer preparation:
  Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
  haudio_out_sai.Instance = AUDIO_SAIx;
  if(HAL_SAI_GetState(&haudio_out_sai) == HAL_SAI_STATE_RESET)
  {
    /* Init the SAI MSP: this __weak function can be redefined by the application*/
    BSP_AUDIO_OUT_MspInit(&haudio_out_sai, NULL);
  }

  if (SAIx_Init(param, AudioFreq) != AUDIO_OK)
  {
    ret = AUDIO_ERROR;
  }

  if(ret == AUDIO_OK)
  {
    /* Retieve audio codec identifier */
    if (_param->device->ReadID(_param->device->param) == CS43L22_ID)
    {
      /* Reset the audio codec Registers */
      AUDIO_CODEC_Reset(param);

      /* Initialize the audio driver structure */
      audio_drv = &cs43l22_drv;
    }
    else
    {
      ret = AUDIO_ERROR;
    }
  }

